c5/src/DataProcessors/UnloadInvoices/UnloadInvoices.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>UnloadInvoices</name>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>IncludeWaiting</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Path</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Invoices</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Customer</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Invoice</name>
      <type>
        <types>DocumentRef.InvoiceRecord</types>
      </type>
    </attributes>
    <attributes>
      <name>LoadingPoint</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Memo</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Unload</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Waiting</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

c5/src/Enums/FormStatuses/FormStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>FormStatuses</name>
  <enumValues>
    <name>Saved</name>
  </enumValues>
  <enumValues>
    <name>Waiting</name>
  </enumValues>
  <enumValues>
    <name>Unloaded</name>
  </enumValues>
  <enumValues>
    <name>Printed</name>
  </enumValues>
  <enumValues>
    <name>Submitted</name>
  </enumValues>
  <enumValues>
    <name>Canceled</name>
  </enumValues>
  <enumValues>
    <name>Returned</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/InvoiceRecord/InvoiceRecord.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>InvoiceRecord</name>
  <basedOn>Document.Invoice</basedOn>
  <basedOn>Document.Transfer</basedOn>
  <basedOn>Document.LVITransfer</basedOn>
  <basedOn>Document.VendorReturn</basedOn>
  <basedOn>Document.Sale</basedOn>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.RangeStatuses</registerRecords>
  <attributes>
    <name>Account</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>AttachedDocuments</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>AttachmentRows</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Base</name>
    <type>
      <types>DefinedType.InvoiceRecordBase</types>
    </type>
  </attributes>
  <attributes>
    <name>Carrier</name>
    <type>
      <types>CatalogRef.Organizations</types>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Organizations</types>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Delegated</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Description</name>
    <type>
      <types>DefinedType.SaleDescription</types>
    </type>
  </attributes>
  <attributes>
    <name>Dispatcher</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Driver</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Factor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstPageRows</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FormNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LoadingAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>LoadingPoint</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PowerAttorneyDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PowerAttorneyNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PowerAttorneySeries</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Prices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>PrintBack</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Range</name>
    <type>
      <types>CatalogRef.Ranges</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>Redirects</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShowServices</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.FormStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>Storekeeper</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Transfer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.Print</types>
    </type>
  </attributes>
  <attributes>
    <name>UnloadingAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>UnloadingPoint</name>
    <type>
      <types>CatalogRef.Organizations</types>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WaybillDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WaybillNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WaybillSeries</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Discounts</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Detail</name>
      <type>
        <types>DocumentRef.Payment</types>
        <types>DocumentRef.Invoice</types>
        <types>DocumentRef.Refund</types>
      </type>
    </attributes>
    <attributes>
      <name>Document</name>
      <type>
        <types>DocumentRef.Invoice</types>
        <types>DocumentRef.Bill</types>
        <types>DocumentRef.SalesOrder</types>
        <types>DocumentRef.Refund</types>
        <types>DocumentRef.Debts</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>ExtraCharge</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.FixedAssets</types>
        <types>CatalogRef.Items</types>
        <types>CatalogRef.IntangibleAssets</types>
      </type>
    </attributes>
    <attributes>
      <name>OtherInfo</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>ProducerPrice</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Series</name>
      <type>
        <types>CatalogRef.Series</types>
      </type>
    </attributes>
    <attributes>
      <name>Social</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>OtherInfo</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/DataProcessors/UnloadInvoices/Forms/Form/Module.bsl
&AtClient
var TableRow;

// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )

	init ();
	readAppearance ();
	Appearance.Apply ( ThisObject );

EndProcedure

&AtServer
Procedure init ()
	
	DataLoaded = false;
	Object.Company = Logins.Settings ( "Company" ).Company;
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|InvoicesWaiting show Object.IncludeWaiting;
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure OnLoadDataFromSettingsAtServer ( Settings )
	
	loadInvoices ();
	DataLoaded = true;
	
EndProcedure

&AtServer
Procedure loadInvoices ()
	
	company = Object.Company;
	if ( company.IsEmpty () ) then
		Object.Invoices.Clear ();
		return;
	endif;
	s = "
	|select allowed Invoices.Ref as Invoice, Invoices.Amount as Amount,
	|	Invoices.Customer.Description as Customer,
	|	Invoices.LoadingPoint.Description as LoadingPoint,
	|	Invoices.Status = value ( Enum.FormStatuses.Saved ) as Unload,
	|	Invoices.Status = value ( Enum.FormStatuses.Waiting ) as Waiting
	|from Document.InvoiceRecord as Invoices
	|where not Invoices.DeletionMark
	|and Invoices.Date between &DateStart and &DateEnd
	|and Invoices.Company = &Company
	|and Invoices.Range.Online
	|and Invoices.Status in ( &Statuses )
	|and ( Invoices.Base = undefined
	|	or not Invoices.Base refs Document.Invoice
	|	or cast ( Invoices.Base as Document.Invoice ).Posted )";
	warehouse = Object.Warehouse;
	if ( not warehouse.IsEmpty () ) then
		s = s + "
		|and Invoices.LoadingPoint = &Warehouse
		|";
	endif;
	s = s + "
	|order by Invoices.Date
	|";
	q = new Query ( s );
	q.SetParameter ( "Company", company );
	q.SetParameter ( "Warehouse", warehouse );
	start = BegOfDay ( CurrentSessionDate () );
	q.SetParameter ( "DateStart", start );
	q.SetParameter ( "DateEnd", EndOfDay ( start ) );
	statuses = new Array ();
	statuses.Add ( Enums.FormStatuses.Saved );
	if ( Object.IncludeWaiting ) then
		statuses.Add ( Enums.FormStatuses.Waiting );
	endif;
	q.SetParameter ( "Statuses", statuses );
	Object.Invoices.Load ( q.Execute ().Unload () );
	
EndProcedure

&AtClient
Procedure OnOpen ( Cancel )
	
	if ( not DataLoaded ) then
		loadInvoices ();
	endif;
	LocalFiles.Prepare ();
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure CompanyOnChange ( Item )
	
	loadInvoices ();
	
EndProcedure

&AtClient
Procedure WarehouseOnChange ( Item )
	
	loadInvoices ();
	
EndProcedure

&AtClient
Procedure IncludeWaitingOnChange ( Item )
	
	applyIncludeWaiting ();
	
EndProcedure

&AtServer
Procedure applyIncludeWaiting ()
	
	loadInvoices ();
	Appearance.Apply ( ThisObject, "Object.IncludeWaiting" );
	
EndProcedure

&AtClient
Procedure PathStartChoice ( Item, ChoiceData, StandardProcessing )
	
	StandardProcessing = false;
	dialog = new FileDialog ( FileDialogMode.Save );
	dialog.Multiselect = false;
	dialog.Filter = "XML (*.xml)|*.xml";
	dialog.FullFileName	= "efactura.xml";
	dialog.Show ( new NotifyDescription ( "SelectFile", ThisObject ) );
	
EndProcedure

&AtClient
Procedure SelectFile ( Files, Params ) export
	
	if ( Files = undefined ) then
		return;
	endif; 
	Object.Path = Files [ 0 ];
	
EndProcedure 

&AtClient
Procedure Unload ( Command )
	
	if ( not CheckFilling () ) then
		return;
	endif;
	if ( run () ) then
		Progress.Open ( UUID, ThisObject, new NotifyDescription ( "Unloading", ThisObject ), true );
	endif;
	
EndProcedure

&AtServer
Function run () 

	list = getSelection ();
	if ( list = undefined ) then
		return false;
	endif;
	if ( not checkData ( list ) ) then
		raise Output.DataInputErrorsFound ();
	endif;
	p = DataProcessors.UnloadInvoices.GetParams ();
	p.Invoices = list;
	Address = PutToTempStorage ( undefined, UUID );
	p.Address = Address;
	args = new Array ();
	args.Add ( "UnloadInvoices" );
	args.Add ( p );
	Jobs.Run ( "Jobs.ExecProcessor", args, UUID, , TesterCache.Testing () );
	return true;

EndFunction

&AtServer
Function getSelection () 

	rows = Object.Invoices.Unload ( new Structure ( "Unload", true ) );
	if ( rows.Count () = 0 ) then
		Output.EmptyUploadList ( , "Invoices" );
		return undefined;
	else
		return rows.UnloadColumn ( "Invoice" );
	endif;
	
EndFunction

&AtServer
Function checkData ( Invoices )
	
	ok = true;
	code = DF.Pick ( Object.Company, "CodeFiscal" );
	if ( code = "" ) then
		Output.UndefinedCodeFiscal1 ( , "Company" );
		ok = false;
	endif;
	errors = wrongInvoices ( Invoices );
	if ( errors.Count () > 0 ) then
		ok = false;
		table = Object.Invoices;
		for each invoice in Invoices do
			error = errors.Find ( invoice, "Invoice" );
			if ( error = undefined ) then
				continue;
			endif;
			row = table.FindRows ( new Structure ( "Invoice", invoice ) ) [ 0 ];
			msg = new Structure ( "Row", Format ( row.LineNumber, "NG=" ) );
			if ( error.CustomerCodeFiscal ) then
				Output.UndefinedCodeFiscal2 ( msg, "Customer", invoice );
			endif;
			if ( error.CustomerBankAccount ) then
				Output.UndefinedAccountNumber ( msg, "CustomerAccount", invoice );
			endif;
			if ( error.CompanyBankAccount ) then
				Output.UndefinedAccountNumber ( msg, "Account", invoice );
			endif;
		enddo;
	endif;
	return ok;
	
EndFunction

&AtServer
Function wrongInvoices ( Invoices )

	s = "
	|select Documents.Ref as Invoice,
	|	isnull ( Documents.Account.AccountNumber, """" ) = """" as CompanyBankAccount,
	|	isnull ( Documents.CustomerAccount.AccountNumber, """" ) = """" as CustomerBankAccount,
	|	Documents.Customer.CodeFiscal = """" as CustomerCodeFiscal
	|from Document.InvoiceRecord as Documents
	|where Documents.Ref in ( &Invoices )
	|and ( isnull ( Documents.Account.AccountNumber, """" ) = """"
	|	or isnull ( Documents.CustomerAccount.AccountNumber, """" ) = """"
	|	or Documents.Customer.CodeFiscal = """" )
	|";
	q = new Query ( s );
	q.SetParameter ( "Invoices", Invoices );
	return q.Execute ().Unload ();

EndFunction

&AtClient
Procedure Unloading ( Result, Params ) export
	
	if ( Result = undefined ) then
		return;
	endif;
	Notify ( Enum.MessageInvoicesExchnage () );
	links = new Array ();
	links.Add ( new TransferableFileDescription ( Object.Path, Address ) );
	BeginGettingFiles ( new NotifyDescription ( "FileWritten", ThisObject ), links, , false );

EndProcedure

&AtClient
Procedure FileWritten ( Files, Params ) export 

	if ( Files = undefined ) then
		return;
	endif; 
	callback = new NotifyDescription ( "SuccessClosed", ThisObject );
	OpenForm ( "DataProcessor.UnloadInvoices.Form.Success", , ThisObject, , , , callback );

EndProcedure

&AtClient
Procedure SuccessClosed ( Result, Params ) export
	
	if ( Result = undefined
		or Result = true ) then
		BeginDeletingFiles ( , Object.Path );
	endif;
	
EndProcedure

// *****************************************
// *********** Table Invoices

&AtClient
Procedure Update ( Command )
	
	loadInvoices ();
	
EndProcedure

&AtClient
Procedure MarkAll ( Command )
	
	mark ( true );
	
EndProcedure

&AtClient
Procedure mark ( Flag ) 

	for each row in Object.Invoices do
		row.Unload = Flag;
	enddo;

EndProcedure

&AtClient
Procedure UnmarkAll ( Command )
	
	mark ( false );
		
EndProcedure

&AtClient
Procedure InvoicesOnActivateRow ( Item )
	
	TableRow = Item.CurrentData;
	
EndProcedure

&AtClient
Procedure InvoicesSelection ( Item, RowSelected, Field, StandardProcessing )

	StandardProcessing = false;
	ShowValue ( , TableRow.Invoice );

EndProcedure
